app/controllers/friends_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    friend_ids = @current_user.friends_from_user_ids + @current_user.friends_to_user_ids
    friend_ids.uniq!
    render json: {} and return if friend_ids.empty?
    friends = User.where(id: friend_ids).order('id DESC')