app/controllers/users_controller.rb

  def create
    # 2018/04/05 harupu Fixed Path traversal vulnerability
    icon_file_name = params[:icon_file_name]
    icon_file_name.gsub!(/\.\.\//, '')
    stat = User.create params.permit(:login_id, :name, :pass, :icon_file_name)
    render json: {errors: stat.errors.full_messages}, status: :bad_request and return if stat.errors.any?

    user = User.find_by log_in: params[:log_in]
    icon_file_path = "#{Rails.root}/public/icons/#{user[:icon_file_name]}"
    user.update icon_file_name: default_icon_path unless File.file? icon_file_path
---
INSERT INTO "users" ("login_id", "name", "pass", "icon_file_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE (login_id = 'aaaa') LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."login_id" = ? AND ("users"."id" != ?) LIMIT ?  [["login_id", "aaaa"], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "icon_file_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["icon_file_name", "presets/6.png"], ["updated_at", "2018-04-25 02:08:42.253380"], ["id", 1]]