app/controllers/users_controller.rb

  def create
    # 2018/04/05 harupu Fixed Path traversal vulnerability
    icon_file_name = params[:icon_file_name]
    icon_file_name.gsub!(/\.\.\//, '')
    stat = User.create params.permit(:login_id, :name, :pass, :icon_file_name)
    render json: {errors: stat.errors.full_messages}, status: :bad_request and return if stat.errors.any?
---
SELECT  1 AS one FROM "users" WHERE "users"."login_id" = ? LIMIT ?  [["login_id", ""], ["LIMIT", 1]]

  def icon
    begin
      user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]